tap "tinygo-org/tools"
brew "helix"
brew "htop"
brew "mise"
brew "neovim"
brew "postgresql@17"
brew "tmux"
brew "tree"
brew "yazi"
brew "zellij"
brew "tinygo-org/tools/tinygo"
cask "1password"
cask "claude-code"
cask "codex"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "ghostty"
cask "google-chrome"
cask "orion"
cask "slack"
