tap "laishulu/homebrew"

brew "helix"
brew "jdtls"
brew "google-java-format"
brew "htop"
brew "mise"
brew "zinit"
brew "postgresql@17"
brew "tree"
brew "yazi"
brew "zellij"
brew "fd"
brew "ripgrep"
brew "bat"
brew "fzf"
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"
cask "1password"
cask "claude-code"
cask "codex"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "ghostty"
cask "keyboardcleantool"
brew "macism"
cask "google-chrome"
cask "raycast"
cask "slack"
